---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsComponentClassificationParam
source: html/cfcc25e0-81ae-aa68-ac21-21ffec4c96e3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsComponentClassificationParam Property

"Component Classification"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsComponentClassificationParam { get; }
```